const popUpText = {
    halogen: `
    <div>
        <h2>Галогены</h2>
        <p>
            Галогены - элементы 17-й (VIIA) группы периодической системы химических элементов (F, Cl, Br, I, At).<br>
            На внешнем уровне: <b>ns<sup>2</sup> np<sup>5</sup></b> электроны.<br>
            Наиболее характерна степень окисления <b>-1</b>. Атомы других галогенов (помимо фтора с посстоянной с.о. -1) способны проявлять положительные степени окисления <b>+1; +3; +5; +7</b>.<br>
            Галогены образуют с металлами соединения с ионной связью, а с другими неметаллами — соединения с ковалентной полярной связью.<br>
        </p>
        <h3>Физические свойства</h3>
        <p>
            При обычных условиях фтор представляет собой светло-жёлтый газ, хлор — жёлто-зелёный газ, бром — красно-коричневую жидкость, иод — тёмно-фиолетовые кристаллы.<br>
            У всех галогенов резкий неприятный запах, и они очень токсичны.<br>
            Твёрдый иод при нагревании легко возгоняется (переходит в газообразное состояние и обратно в твёрдое).
        </p>
        <h3>Химические свойства</h3>
        <h5>Слабо растворяются в воде, фтор вытесняет из нее кислород:</h5>
        <p class="m-big"><i>2F <sub>2</sub> +2H<sub>2</sub>O = 4HF + O<sub>2</sub>↑</i></p>
        <h5>Фтор реагирует со всеми металлами, с некоторыми при нагревании:</h5>
        <p class="m-big"><i>2Au + 3F<sub>2</sub> = AuF<sub>3</sub> (t)</i></p>
        <h5>Остальные галогены реагируют с металлами при нагревании: </h5>
        <p class="m-big"><i>2Fe + 3Cl<sub>2</sub> = 2FeCl<sub>3</sub> (t)</i> </p>
        <h5>Взаимодействуют с водородом (образуется соль):</h5>
        <p class="m-little"><i>H<sub>2</sub> + F<sub>2</sub> = 2HF</i> — фтор взаимодействует с водородом со взрывом</p>
        <p class="m-little"><i>H<sub>2</sub> + Cl<sub>2</sub> = 2HCl (t)</i> — смесь хлора с водородом взрывается только при поджигании или освещении</p>
        <p class="m-little"><i>H<sub>2</sub> + Br<sub>2</sub> = 2HBr (t)</i> — бром начинает реагировать с водородом только при нагревании, и реакция происходит без взрыва</p>
        <p><i>H<sub>2</sub> + I<sub>2</sub> = 2HI (t)</i> — реакция иода с водородом идёт медленно даже при нагревании</p>
        <h5>Более активные галогены вытесняют менее активные из растворов его солей:</h5>
        <p><i>2KBr<sup>-1</sup> + Cl<sub>2</sub><sup>0</sup> = Br<sub>2</sub><sup>0</sup> + 2KCl<sup>-1</sup></i></p>
        <h3>Качественный анализ</h3>
        <h5>Качественная реакция на галогены обычно выполняется с помощью растворов солей серебра (AgNO<sub>3</sub>):</h5>
        <p class="m-little"><i>Ag<sup>+</sup> + Cl<sup>-</sup> = AgCl↓</i> — осадок белого цвета</p>
        <p class="m-little"><i>Ag<sup>+</sup> + Br<sup>-</sup> = AgBr↓</i> — осадок бледно-желтого цвета</p>
        <p class="m-little"><i>Ag<sup>+</sup> + I<sup>-</sup> = AgI↓</i> — осадок желтого цвета</p>
    </div>`,
    chalcogene: `
    <div>
        <h2>Халькогены</strong></h2>
        <p>
            Халькогены — химические элементы 16-й группы периодической таблицы химических элементов. <br>
            На внешнем энергетическом уровне 6 электронов. Имеют аллотропные модификации.
        </p>        
    </div>`,
    alkaline: `
    <div>
        <big><strong>Щелочные металлы</strong></big><br><br>
        Щелочные металлы - элементы 1-й группы периодической системы химических элементов (Li, Na, K, Rb, Cs, Fr).<br>
        На внешнем уровне: <strong>ns<sup>1</sup></strong> электрон.
        Для всех металлов характерна степень окисления <strong>+1</strong>.<br><br>
        <strong>Физические свойства</strong>: легкоплавкие металлы серебристо-белого (литий, натрий, калий, рубидий) 
        или золотисто-жёлтого (цезий) цвета, обладающие высокой мягкостью и пластичностью.<br>Наиболее твёрдым является литий, 
        остальные щелочные металлы легко режутся ножом и могут быть раскатаны в фольгу.<br><br> 
        <strong>Химические свойства</strong>:<br>
        *все щелочные металлы активно реагируют с водой, выделяя из неё водород: <br>
        <i>2Li +2H<sub>2</sub>O = 2LiOH + H<sub>2</sub>↑</i> <br>
        *взаимодействуют с кислородом (образуя оксиды формулы Э<sub>2</sub>O): <br>
        <i>4Li + O<sub>2</sub> = 2Li<sub>2</sub>O (оксид лития)</i> <br> *взаимодействуют с неметаллами (образуется соль): <br>
        <i>2Li + Cl<sub>2</sub> = 2LiCl</i> <br> *взаимодействуют с кислотами (образуются соль и водород): <br>
        <i>2Na + 2HCl = 2NaCl + H<sub>2</sub>↑</i><br><br>
        <u>Свойства оксидов:</u><br>*взаимодействуютс водой:<br>
        <i>Li<sub>2</sub>O + H<sub>2</sub>O = 2LiOH</i><br>
        *взаимодействуют с кислотными оксидами:<br>
        <i>K<sub>2</sub>O + CO<sub>2</sub> = K<sub>2</sub>CO<sub>3</sub></i><br>
        *взаимодействуют с кислотами:<br>
        <i>Na<sub>2</sub>O + 2HCl = 2KCl + H<sub>2</sub>O</i><br><br>
        <u>Свойства оснований - щелочей:</u> <br>
        *взаимодействуют с кислотами - реакция нейтрализации (образуются соль и вода):<br>
        <i>NaOH + HCl = NaCl + H<sub>2</sub>O</i><br>*взаимодействуют с кислотными оксидами (образуются соль и вода): <br>
        <i>2KOH + SO<sub>3</sub> = K<sub>2</sub>SO<sub>4</sub> +H<sub>2</sub>O</i><br>
        *взаимодействуют с амфотерными гидроксидами (образуются комплексная соль и вода): <br>
        <i>2NaOH + Be(OH)<sub>2</sub> = Na<sub>2</sub>[Be(OH)<sub>4</sub>]</i><br>
        *взаимодействуют с амфотерными оксидами (образуются соль и вода): <br>
        <i>2KOH + Al<sub>2</sub>O<sub>3</sub> = 2KAlO<sub>2</sub> +H<sub>2</sub>O</i> <br>
        *взаимодействуют с растворимыми солями (образуются соль и основание): <br>
        <i>2NaOH + CuSO<sub>4</sub> = Na<sub>2</sub>SO<sub>4</sub> + Cu(OH)<sub>2</sub>↓</i><br><br>
        <u>Качественный анализ:</u><br>
        *Соединения щелочных металлов окрашивают пламя в характерные цвета.<br>
        Соли лития придают ему карминово-красный цвет, соли натрия — жёлтый, калия — фиолетовый, рубидия и цезия — светло-фиолетовый.
    </div>`,
    alkalineEarth: `
    <div>
        <big><strong>Be, Mg и щелочноземельные металлы</strong></big><br><br>
        Щелочноземельные металлы - элементы 2-й группы периодической системы химических элементов (Ca, Sr, Ba, Ra).<br>
        На внешнем уровне: <strong>ns<sup>2</sup></strong> электрон.
        Для всех металлов характерна степень окисления <strong>+2</strong>.<br><br> 
        <strong>Физические свойства</strong>: имеют металлический блеск, ковкость, пластичность, высокую тепло- и электропроводность.<br><br> 
        <strong>Химические свойства</strong>:<br>*Be и Mg инертны к воде, Ca, Sr и Ba растворяются в воде (образуя гидроксид): <br>
        <i>Ca +2H<sub>2</sub>O = Li(OH)<sub>2</sub> + H<sub>2</sub>↑</i> <br>*взаимодействуют с кислородом (образуя оксиды формулы ЭO):<br>
        <i>Ba + O = BaO</i><br>*взаимодействуют с кислотами (образуются соль и водород): <br>
        <i>Ba + 2HCl = BaCl<sub>2</sub> + H<sub>2</sub></i> <br> *взаимодействуют с неметаллами (образуется соль): <br>
        <i>Sr + Br<sub>2</sub> = SrBr<sub>2</sub></i> <br><br>
        <u>Свойства оксидов:</u><br>*взаимодействуютс водой:<br>
        <i>CaO + H<sub>2</sub>O = Ca(OH)<sub>2</sub></i> - реакция гашения извести<br>
        *взаимодействуют с кислотными оксидами:<br>
        <i>BaO + CO<sub>2</sub> = Ba<sub>2</sub>CO<sub>3</sub></i><br>
        *взаимодействуют с кислотами:<br><i>SrO + 2HCl = SrCl<sub>2</sub> + H<sub>2</sub>O</i><br><br>
        <u>Свойства оснований - щелочей:</u> <br>
        *при нагревании разлагаются (образуются соответствующий оксид и вода):<br>
        <i>Ba(OH)<sub>2</sub> = BaO + H<sub>2</sub>O (t)</i><br>
        *взаимодействуют с кислотными оксидами (образуются соль и вода): <br>
        <i>Ca(OH)<sub>2</sub> + CO<sub>2</sub> = Ca<sub>2</sub>CO<sub>3</sub>↓ +H<sub>2</sub>O</i> - качественная реакция на углекислый газ<br>
        *взаимодействуют с кислотами - реакция нейтрализации (образуются соль и вода):<br>
        Ba(OH)<sub>2</sub> + 2HCl = BaCl<sub>2</sub> + 2H<sub>2</sub>O<br><br>
        <u>Качественный анализ:</u><br>
        *Соединения кальция окрашивают пламя в кирпично-красный цвет.<br>
        *Качественная реакция на ионы бария:<br>
        <i>Ba<sup>2+</sup> + SO<sup>4</sup> = BaSO<sup>4</sup>↓</i>
    </div>`,
}

export default popUpText;